def apply_template(result: str) -> str:
    template = f"""
=========================================
[AI 어시스턴트 응답]
=========================================
결과:
{result}
=========================================
"""
    return template.strip()


def calc_template(result: str, a, b, c) -> str:
    template = f"""
=========================================
[AI Calc 어시스턴트 응답]
=========================================
결과: 주어진 입력값 {a}와 {b}를 {c} 연산한 결과는 {result}입니다.
=========================================
    """
    return template.strip()
def get_time_template(result: str) -> str:
    template = f"""
=========================================
[AI Get Time 어시스턴트 응답]
=========================================
결과: 현재 시간은 {result}입니다.
=========================================
    """
    return template.strip()